import '../models/nekath.dart';

List<Nekath> sampleNekathList = [
  Nekath(
    title: "නව සද බැලීම🌞", 
    dateTime: DateTime(2025, 3, 30, 12, 00),
    description: "අවුරුදු සන්ධියේ නව සද බැලීමේ පුරුදුය.",
  ),
  Nekath(
    title: "පරණ අවුරුද්ද සදහා ස්නානය🌞", 
    dateTime: DateTime(2025, 4, 13, 10, 12),
    description: "පරණ අවුරුද්ද නිමවන විට විශේෂ ස්නානයක් සිදු කරයි.",
  ),
  Nekath(
    title: "අළුත් අවුරුදු උදාව🌞", 
    dateTime: DateTime(2025, 4, 14, 3, 21),
    description: "අළුත් අවුරුද්ද පිළිගන්නා විශේෂ මොහොතයි.",
  ),
  Nekath(
    title: "පුණ්‍ය කාලය🌞", 
    dateTime: DateTime(2025, 4, 14, 8, 57),
    description: "මෙය පුණ්‍ය කාලය වන අතර කිසිදු කාර්යයක් සිදු නොකෙරේ.",
  ),
  Nekath(
    title: "අහාර පිසීම🌞", 
    dateTime: DateTime(2025, 4, 14, 4, 4),
    description: "අවුරුදු ආහාර පිසීම සදහා සුදුසු මොහොත.",
  ),
  Nekath(
    title: "වැඩ ඇල්ලීම, ගණුදෙනු කිරීම හා ආහාර අනුභවය🌞", 
    dateTime: DateTime(2025, 4, 14, 6, 44),
    description: "නව අවුරුද්දේ මුල් වැඩ ආරම්භ කිරීමේ හා ආහාර අනුභවය සදහා මොහොත.",
  ),
  Nekath(
    title: "හිත තෙල් ගෑම🌞", 
    dateTime: DateTime(2025, 4, 16, 9, 4),
    description: "සිංහල පසුගිය සදහසකට අනුව ශරීරය තෙල් ගාන්නා පුරුදුය.",
  ),
  Nekath(
    title: "රැකීරක්ශා සදහා පිටත්ව යාම🌞", 
    dateTime: DateTime(2025, 4, 17, 9, 3),
    description: "නව අවුරුද්දේ වැඩ කිරීමට පිටත්ව යාමට සුදුසු මොහොත.",
  ),
];
